public class Main {
    public static void main(String [] args) {
        /*
        //1. Напишите программу для умножения 10 на 5 и вывода результата в консоль.
        int a = 10;
        int b = 5;
        int c = 10 * 5;
        System.out.println("a * b = " + c);

         */


        // 2. Напишите программу для деления 20 на 2.5 и вывода результата в консоль.
        /*
        int a = 20;
        double b = 2.5;
        double c = 20 / 2.5;
        System.out.println("a / b = " + c);

         */

        // 3. Длина и ширина прямоугольника равны 15 и 9 соответственно.
        // Напишите программу для вычисления площади и периметра прямоугольника.

        /*
        int a = 15;
        int b = 9;
        int S = a * b;
        int P = a + b;
        System.out.println("Площадь прямоугольника (S) равна = " + S);
        System.out.println("Периметр прямоугольника (P) равен = " + P);

         */

        // 4. Используйте правильный оператор, чтобы увеличить значение переменной x на 1 с помощью
        // префиксной и постфиксной форм. Выведите на экран результат.

        /*

       int x = 3;
       x = ++x;
       System.out.println(x); // префикс
       x = x++;
       System.out.println(x); // постфикс
       System.out.println("x = " + ++x);
       System.out.println("x = " + x++);

         */

       // 5. Используйте оператор присваивания сложения, чтобы добавить значение 5 к переменной x.

        /*

        int x = 20;

        System.out.println("x += " + (x += 5));

         */

        // 6. Напишите программу для проверки равенства двух чисел 25 и 43.

        /*

        int a = 25;
        int b = 43;
        System.out.println(a + "=" + b + ":" + (a==b));
        System.out.println(a + "<" + b + ":" + (a<b));
        System.out.println(a + "<=" + b + ":" + (a<=b));

         */

        // 7. Даны две переменные a и b, значения которых равны 10 и 5 соответственно.
        // Напишите программу для сложения, вычитания, умножения, деления, деления по модулю двух переменных.

        /*

        int a = 10;
        int b = 5;
        int sum = a + b;
        int minus = a - b;
        int multiply = a * b;
        int divide = a / b;
        int remainder = a % b;
        System.out.println("Сложения = " + sum);
        System.out.println("Вычитания = " + minus);
        System.out.println("Умножения = " + multiply);
        System.out.println("Деления = " + divide);
        System.out.println("Деления по модулю двух переменных = " + remainder);

         */

        // 8. Напишите программу для преобразования градусов Фаренгейта в градусы Цельсия.

        /*

        int C = 23;
        double F = (C * 1.8) + 32;
        System.out.println("23 градуса по Цельсию = " + F + " градуса по Фаренгейту");

         */

        // 9. Напишите программу, которая прибавляет 10 к числу 451, а затем делит его на 3.
        // Теперь к модулю результата прибавляется 5, а затем полученное значение умножается на 5.
        // Выведите на экран окончательный результат.

        /*

        int a = 451;
        int b = (a += 10) / 3;
        System.out.println(b);
        int c = (b % 3) + 5;
        System.out.println(c);
        int d = c * 5;
        System.out.println("Окончательный результат = " + d);

         */

        // 10. Даны две переменные a и b, значения которых равны 65 и 80 соответственно.
        // Напишите программу, чтобы проверить, верны ли оба условия 'a < 50' и 'a < b'.

        int a = 65;
        int b = 80;
        System.out.println("a < 50 :" + (a < 50));
        System.out.println("a < b :" + (a < b));















    }
}